package org.pablos.frontend.domain.enums;

import java.io.Serializable;

/**
 * Перечисление, представляющее типы сортировки.
 */
public enum SortingType implements Serializable {
    /**
     * Сортировка по имени в алфавитном порядке.
     */
    NAME_ASC,
    /**
     * Сортировка по имени в обратном алфавитном порядке.
     */
    NAME_DESC,
    /**
     * Сортировка по возрасту в порядке возрастания.
     */
    AGE_ASC,
    /**
     * Сортировка по возрасту в порядке убывания.
     */
    AGE_DESC,
    /**
     * Сортировка по стоимости билета в порядке возрастания.
     */
    FARE_ASC,
    /**
     * Сортировка по стоимости билета в порядке убывания.
     */
    FARE_DESC
}



